// ------------1.-------создать функцию принимающую строку и возвращающая гласные буквы

// function disemvowel(str) {
//     let newStr = (str.replace(/A|E|I|O|U|a|e|i|o|u/g, ''))
//     return newStr;
//    }

//2.========= Проверьте, содержит ли строка одинаковое количество «x» и «o». Метод должен возвращать логическое значение и не учитывать регистр. Строка может содержать любой символ.

// function XO(str) {
   
//         return str.toLowerCase().split('x').length === str.toLowerCase().split('o').length;
//     }



//---3----------Завершите функцию, которая принимает два аргумента и возвращает все числа, которые делятся на данный делитель. Первый аргумент - это массив чисел, а второй - делитель.

//Пример

//const divisibleBy = (numbers, divisor) => numbers.filter( num => num % divisor ===0)


 


